# 추천 시스템
- 사용자 집단별 추천
    - 성별

In [2]:
import pandas as pd

## 전처리

In [4]:
# 사용자 
users = pd.read_csv('users.csv')
users[:3]

   user_id  age gender         job zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

In [5]:
# 영화 평점
ratings = pd.read_csv('ratings.csv')
ratings[:3]

   user_id  movie_id  rating  timestamp
0        1        55       5  875072688
1        1       203       4  878542231
2        1       183       5  875072262

In [6]:
# 영화 정보
movies = pd.read_csv('movies.csv')
movies[:3]

,movie_id,title,release date,imdb url,action,adventure,animation,children,comedy,crime,...,fantasy,film-noir,horror,musical,mystery,romance,sci-fi,thriller,war,western
0,1,Toy Story (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?GoldenEye%20(...,1,1,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [7]:
# ratings의 timestamp 컬럼 삭제
del ratings['timestamp']

In [9]:
ratings.columns

Index(['user_id', 'movie_id', 'rating'], dtype='object')

In [12]:
# movies의 movie_id, title만 사용
movies = movies[['movie_id', 'title']]
movies[:3]

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)

## 데이터 셋 분리
- Train data
    - 모델을 학습하기 위한 데이터 셋
    - 학습은 최적의 파라미터를 찾는 것
    - 학습을 위한 데이터
    <br><br>
- Test data
    - 모델의 '최종 성능'을 평가하기 위한 데이터 셋
    - 모델 학습에 관여하지 않음
    <br><br>
- Train data로 학습을 하고, Test data로 최종 성능 평가

In [13]:
# train, test set 분리
from sklearn.model_selection import train_test_split

In [17]:
x= ratings.copy()
y= ratings.user_id

In [19]:
# x_train : 학습용 데이터
# x_test : 정확도 검증용 데이터
# y_train, y_test : 사용자 ID
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.25, stratify=y) # test_size : 테스트용 데이터의 비율, stratify : ?

In [22]:
x.shape

(100000, 3)

In [23]:
x_train.shape

(75000, 3)

In [31]:
x_train

       user_id  movie_id  rating
46111      409       178       5
15184      151       223       5
82901      773       109       4
25343      257       288       3
48953      435        38       2
...        ...       ...     ...
92443      876       286       5
15945      160       218       4
26794      269       985       3
49540      440       304       5
74679      680       248       4

[75000 rows x 3 columns]

In [25]:
x_test.shape

(25000, 3)

In [29]:
y_train.shape

(75000,)

In [32]:
y_train

46111    409
15184    151
82901    773
25343    257
48953    435
        ...
92443    876
15945    160
26794    269
49540    440
74679    680
Name: user_id, Length: 75000, dtype: int64

In [30]:
y_test.shape

(25000,)